The same error is thrown with or without setting that property - the bug here is that the backup CRN should not get set for me unless I explicitly set it.

Here is the error from the latest run (about an hour ago):
```
<SNIP>
Terraform will perform the following actions:
 2023/09/27 14:09:28 Terraform apply | 
 2023/09/27 14:09:28 Terraform apply |   # module.gitlab-icdpostgres15-eu-es.ibm_database.postgresql_db will be created
 2023/09/27 14:09:28 Terraform apply |   + resource "ibm_database" "postgresql_db" {
 2023/09/27 14:09:28 Terraform apply |       + adminuser                    = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + backup_encryption_key_crn    = "crn:v1:bluemix:public:kms:eu-es:a/cad1cd992c9f2344b0785e4f0fed0669:bc0ed3d3-abd9-4a18-9282-82e5e45e39cb:key:e502392d-9c83-4071-82f7-934210dd56db"
 2023/09/27 14:09:28 Terraform apply |       + configuration                = jsonencode(
 2023/09/27 14:09:28 Terraform apply |             {
 2023/09/27 14:09:28 Terraform apply |               + max_connections = 500
 2023/09/27 14:09:28 Terraform apply |             }
 2023/09/27 14:09:28 Terraform apply |         )
 2023/09/27 14:09:28 Terraform apply |       + configuration_schema         = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + connectionstrings            = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + groups                       = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + guid                         = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + id                           = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + key_protect_key              = "crn:v1:bluemix:public:kms:eu-es:a/cad1cd992c9f2344b0785e4f0fed0669:bc0ed3d3-abd9-4a18-9282-82e5e45e39cb:key:e502392d-9c83-4071-82f7-934210dd56db"
 2023/09/27 14:09:28 Terraform apply |       + location                     = "eu-es"
 2023/09/27 14:09:28 Terraform apply |       + members_cpu_allocation_count = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + members_disk_allocation_mb   = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + members_memory_allocation_mb = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + name                         = "gitlab-icdpostgres15-eu-es"
 2023/09/27 14:09:28 Terraform apply |       + node_count                   = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + node_cpu_allocation_count    = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + node_disk_allocation_mb      = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + node_memory_allocation_mb    = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + plan                         = "standard"
 2023/09/27 14:09:28 Terraform apply |       + resource_controller_url      = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + resource_crn                 = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + resource_group_id            = "cfa1df67148747b68e2bf9532141aeea"
 2023/09/27 14:09:28 Terraform apply |       + resource_group_name          = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + resource_name                = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + resource_status              = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + service                      = "databases-for-postgresql"
 2023/09/27 14:09:28 Terraform apply |       + service_endpoints            = "public-and-private"
 2023/09/27 14:09:28 Terraform apply |       + status                       = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + tags                         = (known after apply)
 2023/09/27 14:09:28 Terraform apply |       + version                      = "15"
 2023/09/27 14:09:28 Terraform apply | 
 2023/09/27 14:09:28 Terraform apply |       + group {
 2023/09/27 14:09:28 Terraform apply |           + group_id = "member"
 2023/09/27 14:09:28 Terraform apply | 
 2023/09/27 14:09:28 Terraform apply |           + cpu {
 2023/09/27 14:09:28 Terraform apply |               + allocation_count = 4
 2023/09/27 14:09:28 Terraform apply |             }
 2023/09/27 14:09:28 Terraform apply | 
 2023/09/27 14:09:28 Terraform apply |           + disk {
 2023/09/27 14:09:28 Terraform apply |               + allocation_mb = 131072
 2023/09/27 14:09:28 Terraform apply |             }
 2023/09/27 14:09:28 Terraform apply | 
 2023/09/27 14:09:28 Terraform apply |           + members {
 2023/09/27 14:09:28 Terraform apply |               + allocation_count = 2
 2023/09/27 14:09:28 Terraform apply |             }
 2023/09/27 14:09:28 Terraform apply | 
 2023/09/27 14:09:28 Terraform apply |           + memory {
 2023/09/27 14:09:28 Terraform apply |               + allocation_mb = 65536
 2023/09/27 14:09:28 Terraform apply |             }
 2023/09/27 14:09:28 Terraform apply |         }
 2023/09/27 14:09:28 Terraform apply | 
 2023/09/27 14:09:28 Terraform apply |       + timeouts {
 2023/09/27 14:09:28 Terraform apply |           + create = "120m"
 2023/09/27 14:09:28 Terraform apply |         }
 2023/09/27 14:09:28 Terraform apply |     }
 2023/09/27 14:09:28 Terraform apply | 
 2023/09/27 14:09:28 Terraform apply |   # module.gitlab-icdpostgres15-eu-es.ibm_iam_authorization_policy.kms_policy[0] will be created
<SNIP>
2023/09/27 14:10:06 Terraform apply |         "details": "{\"error\":\"KMSError\",\"description\":\"We were unable to complete your request: Backup encryption keys are not supported in this region. Try again with valid values or contact support if the issue persists.\"}",
 2023/09/27 14:10:06 Terraform apply |         "error_code": "RC-ServiceBrokerErrorResponse",
 2023/09/27 14:10:06 Terraform apply |         "message": "Please contact the Service Provider for this error. [400, Bad Request] We were unable to complete your request: Backup encryption keys are not supported in this region. Try again with valid values or contact support if the issue persists.",
 2023/09/27 14:10:06 Terraform apply |         "status_code": 422,
 2023/09/27 14:10:06 Terraform apply |         "transaction_id": "bss-9990fdf5065ba60d"
 2023/09/27 14:10:06 Terraform apply |     },
 2023/09/27 14:10:06 Terraform apply |     "RawResult": null
 2023/09/27 14:10:06 Terraform apply | }
 2023/09/27 14:10:06 Terraform apply | 
 2023/09/27 14:10:06 Terraform apply | 
 2023/09/27 14:10:06 Terraform apply |   with module.gitlab-icdpostgres15-eu-es.ibm_database.postgresql_db,
 2023/09/27 14:10:06 Terraform apply |   on .terraform/modules/gitlab-icdpostgres15-eu-es/main.tf line 50, in resource "ibm_database" "postgresql_db":
 2023/09/27 14:10:06 Terraform apply |   50: resource "ibm_database" "postgresql_db" {
 2023/09/27 14:10:06 Terraform apply | 
 2023/09/27 14:10:06 Terraform apply | 
 2023/09/27 14:10:06 Terraform apply | Error: [ERROR] Error creating database instance: Please contact the Service Provider for this error. [400, Bad Request] We were unable to complete your request: Backup encryption keys are not supported in this region. Try again with valid values or contact support if the issue persists.
```